'use strict';

console.log('1');

setTimeout(() => console.log('setTimeout_2000'), 2000);

setTimeout(() => console.log('setTimeout_4000'), 4000);

console.log('2');


///////////////////////////////////////////////////////////////////////////////

let k = 0;              //задача подвесит браузер пока не выполнится, лучше такие разбивать на мелкие подзадачи, чтобы в промежутках выполнялись и другие 

function count() {
    for (let i = 0; i < 1e9; i++) {
        k++;
    }
    alert('done');
}
count();


///////////////////////////////////////////////////////////////////////////////

setTimeout(() => console.log(1), 0);   // асинхронный код всегда после синфхронного, по умолчанию задержка не 0 а 4 мкс для совместимости браузеров

console.log('2');   //синхронный код